[
    {
        "intent": "Menu_Inquiry",
        "patterns": [
            "Có món gì hôm nay không?",
            "Cho tôi xem menu.",
            "Hôm nay có khuyến mãi không?",
            "Tôi muốn biết các món ăn nhanh nào đang có.",
            "Menu hôm nay có gì đặc biệt không?",
            "Bạn có bán pizza không?",
            "Có món mới nào không?",
            "Tôi muốn biết các món ăn có trong thực đơn.",
            "Có món nào không cay không?",
            "Cửa hàng có bán nước uống gì không?",
            "Có món tráng miệng không?",
            "Có combo tiết kiệm nào không?",
            "Menu có thay đổi gì hôm nay không?"
        ],
        "responses": [
            "Chào bạn! Menu hôm nay gồm: Pizza, Gà rán, và Burger. Bạn cần thêm thông tin gì không?",
            "Đây là menu hôm nay của chúng tôi: http://localhost:9966/shop/menu.",
            "Bạn có thể kiểm tra các món ăn kèm ưu đãi tại đây: [link khuyến mãi].",
            "Các món nước uống có sẵn gồm: Nước ngọt, Nước suối,..."
        ]
    },
    {
        "intent": "Order_Placement",
        "patterns": [
            "Tôi muốn đặt một phần gà rán.",
            "Làm sao để đặt món?",
            "Đặt 2 cái pizza và 1 coca.",
            "Tôi có thể đặt đồ ăn qua đây không?",
            "Làm sao để đặt hàng?",
            "Tôi có thể đặt đồ ăn như thế nào?",
            "Tôi muốn đặt 3 phần gà rán.",
            "Tôi cần đặt 2 phần pizza lớn.",
            "Có thể đặt combo không?",
            "Làm sao để thêm món vào giỏ hàng?",
            "Cửa hàng có giao hàng tận nơi không?",
            "Làm sao để huỷ đơn hàng?",
            "Tôi muốn đặt hàng qua điện thoại được không?",
            "Có chương trình đặt hàng qua app không?"
        ],
        "responses": [
            "Bạn vui lòng cho biết chi tiết món ăn và số lượng để tôi hỗ trợ đặt hàng nhé!",
            "Chúng tôi hỗ trợ đặt món qua chatbot. Hãy nhập món bạn muốn đặt.",
            "Vui lòng điền thông tin đặt hàng tại đây: [form đặt hàng].",
            "Chúng tôi có combo ưu đãi, bạn muốn tham khảo không?"
        ]
    },
    {
        "intent": "Delivery_Time_Inquiry",
        "patterns": [
            "Thức ăn sẽ giao trong bao lâu?",
            "Khi nào đồ ăn tới?",
            "Giao hàng mất bao nhiêu thời gian?",
            "Tôi cần biết thời gian giao hàng.",
            "Khi nào đơn hàng của tôi sẽ đến?",
            "Tôi có thể nhận hàng trong vòng bao lâu?",
            "Giao hàng nhanh nhất là bao lâu?",
            "Có giao hàng trong ngày không?",
            "Giao hàng mất khoảng bao lâu?",
            "Có dịch vụ giao hàng nhanh không?",
            "Có thể giao trong vòng 20 phút không?",
            "Giao hàng miễn phí trong bao xa?",
            "Tôi muốn nhận hàng trong vòng 1 giờ.",
            "Đơn hàng có thể đến trước 12h không?"
        ],
        "responses": [
            "Thời gian giao hàng dự kiến từ 30-45 phút tùy vào khoảng cách.",
            "Đơn hàng của bạn sẽ đến trong vòng 40 phút. Bạn cần hỗ trợ gì thêm không?",
            "Chúng tôi sẽ cố gắng giao hàng nhanh nhất có thể!"
        ]
    },
    {
        "intent": "Payment_Method_Inquiry",
        "patterns": [
            "Tôi có thể thanh toán bằng thẻ không?",
            "Hình thức thanh toán là gì?",
            "Chỗ bạn có hỗ trợ trả tiền mặt không?",
            "Thanh toán online như thế nào?",
            "Có thể trả bằng thẻ Visa không?",
            "Có hỗ trợ thanh toán qua Paypal không?",
            "Có thể thanh toán qua ví điện tử nào?",
            "Cửa hàng có hỗ trợ trả góp không?",
            "Thanh toán bằng QR code được không?",
            "Có thể thanh toán khi nhận hàng không?",
            "Thanh toán qua chuyển khoản như thế nào?",
            "Cửa hàng có chấp nhận Mastercard không?",
            "Làm sao để hoàn tiền nếu thanh toán online?",
            "Có thể trả tiền trước không?"
        ],
        "responses": [
            "Chúng tôi hỗ trợ thanh toán qua tiền mặt, thẻ tín dụng, và ví điện tử.",
            "Bạn có thể thanh toán qua ZaloPay, Momo, hoặc chuyển khoản ngân hàng."
        ]
    },
    {
        "intent": "Order_Status_Inquiry",
        "patterns": [
            "Đơn hàng của tôi đâu rồi?",
            "Kiểm tra trạng thái đơn hàng.",
            "Đơn của tôi đã giao chưa?",
            "Tôi muốn biết trạng thái đơn hàng của mình.",
            "Làm sao để kiểm tra đơn hàng của tôi?",
            "Đơn hàng có giao đúng giờ không?",
            "Tôi muốn biết đơn hàng có giao chưa.",
            "Đơn hàng đang ở đâu rồi?",
            "Làm sao để tra cứu đơn hàng?",
            "Tôi có thể hủy đơn hàng không?",
            "Cửa hàng có gửi thông báo khi đơn hàng đến không?",
            "Có thể kiểm tra trạng thái đơn hàng online không?",
            "Cửa hàng có cập nhật trạng thái qua SMS không?",
            "Đơn hàng của tôi bị trễ, làm sao bây giờ?"
        ],
        "responses": [
            "Vui lòng cung cấp mã đơn hàng để tôi kiểm tra giúp bạn.",
            "Bạn có thể tra cứu trạng thái đơn hàng tại đây: [link tra cứu]."
        ]
    },
    {
        "intent": "Product_Recommendation",
        "patterns": [
            "Món nào ngon nhất ở đây?",
            "Bạn gợi ý món ăn nào đi.",
            "Món nào đang được yêu thích nhất?",
            "Tôi không biết chọn món nào, bạn giúp nhé.",
            "Có món nào ngon nhất không?",
            "Bạn gợi ý món nào cho bữa tối?",
            "Món nào phù hợp cho trẻ em?",
            "Tôi muốn thử món đặc biệt nhất.",
            "Có món ăn nhẹ nào không?",
            "Cửa hàng có món tráng miệng ngon không?",
            "Món nào đang giảm giá vậy?",
            "Có món nào cho người ăn chay không?",
            "Món nào phù hợp cho bữa sáng?",
            "Bạn có món ăn kèm nào không?"
        ],
        "responses": [
            "Món được yêu thích nhất hiện tại là Pizza đặc biệt và Gà rán giòn cay.",
            "Bạn có thể thử combo pizza và coca, đây là món bán chạy nhất."
        ]
    },
    {
        "intent": "Store_Locations_Inquiry",
        "patterns": [
            "Chi nhánh gần nhất ở đâu?",
            "Tôi muốn tìm cửa hàng của bạn.",
            "Làm sao để đến cửa hàng?",
            "Cửa hàng ở đâu?",
            "Có cửa hàng nào gần đây không?",
            "Làm sao để tìm cửa hàng gần nhất?",
            "Cửa hàng có ở quận 1 không?",
            "Làm sao để đến cửa hàng nhanh nhất?",
            "Cửa hàng có ở trung tâm thương mại không?",
            "Có dịch vụ giao hàng tận nơi không?",
            "Cửa hàng mở cửa từ mấy giờ?",
            "Có thể đặt món tại cửa hàng không?",
            "Cửa hàng có bãi đỗ xe không?",
            "Tôi có thể đặt món và nhận tại cửa hàng không?"
        ],
        "responses": [
            "Bạn vui lòng nhập vị trí hiện tại, tôi sẽ gửi bạn chi nhánh gần nhất.",
            "Bạn có thể xem danh sách các cửa hàng tại đây: [link cửa hàng]."
        ]
    },
    {
        "intent": "Feedback_or_Complaint",
        "patterns": [
            "Đồ ăn giao chậm quá.",
            "Tôi muốn gửi ý kiến đóng góp.",
            "Có chỗ nào để phản hồi không?",
            "Đơn hàng bị sai rồi.",
            "Đơn hàng của tôi bị sai món.",
            "Tôi muốn khiếu nại về dịch vụ.",
            "Món ăn bị nguội.",
            "Tôi không hài lòng với chất lượng món ăn.",
            "Dịch vụ giao hàng quá chậm.",
            "Tôi muốn gửi phản hồi về đơn hàng vừa nhận.",
            "Có nơi nào để khiếu nại không?",
            "Làm sao để gửi ý kiến đóng góp?",
            "Tôi không thích dịch vụ ở cửa hàng.",
            "Đồ ăn bị thiếu món rồi!"
        ],
        "responses": [
            "Rất xin lỗi bạn! Vui lòng cung cấp mã đơn hàng để chúng tôi kiểm tra.",
            "Cảm ơn phản hồi của bạn, chúng tôi sẽ liên hệ sớm để giải quyết."
        ]
    },
    {
        "intent": "Promotion_Inquiry",
        "patterns": [
            "Hôm nay có khuyến mãi gì không?",
            "Chỗ bạn có giảm giá không?",
            "Có chương trình ưu đãi nào không?"
        ],
        "responses": [
            "Hôm nay chúng tôi đang có chương trình 'Mua 1 tặng 1' áp dụng cho combo Gà rán.",
            "Bạn có thể xem thêm chi tiết ưu đãi tại đây: [link ưu đãi]."
        ]
    },
    {
        "intent": "General_Greeting",
        "patterns": [
            "Xin chào.",
            "Hi.",
            "Chào bot."
        ],
        "responses": [
            "Chào bạn! Tôi có thể giúp gì cho bạn hôm nay?",
            "Chào mừng bạn đến với MainlandPrime! Bạn cần hỗ trợ gì không?"
        ]
    },
    {
        "intent": "Goodbye",
        "patterns": [
            "Tạm biệt.",
            "Cảm ơn nhé.",
            "Bye."
        ],
        "responses": [
            "Cảm ơn bạn đã ghé thăm! Hẹn gặp lại.",
            "Chúc bạn một ngày vui vẻ! Tạm biệt."
        ]
    },
    {
        "intent": "Unknown",
        "patterns": [
            "Tôi không hiểu lắm.",
            "Làm cái này như thế nào?",
            "?"
        ],
        "responses": [
            "Xin lỗi, tôi chưa hiểu câu hỏi của bạn. Bạn có thể nói rõ hơn không?",
            "Tôi không chắc về điều đó. Bạn vui lòng thử lại hoặc liên hệ hotline: 0779009487."
        ]
    }
]
